package main

import "fmt"

func main() {
	var x, y, z uint8

	x = 9  // x = 00001001
	y = 28 // y = 00011100
	z = x

	fmt.Println("Битовые операции")

	// ^x - побітове заперечення (інвертація всіх бітів числа)
	// x = 00001001 -> ^x = 11110110 (246)
	fmt.Printf("^x      = ^(%d)      = ^(%.8b)            = %.8b = %d\n", x, x, ^x, ^x)

	// x << 2 - зсув вліво на 2 біти
	// x = 00001001 -> x << 2 = 00100100 (36)
	fmt.Printf("x << 2  = (%d << 2)  = (%.8b << 2)        = %.8b = %d\n", x, x, x<<2, x<<2)

	// x >> 2 - зсув вправо на 2 біти
	// x = 00001001 -> x >> 2 = 00000010 (2)
	fmt.Printf("x >> 2  = (%d >> 2)  = (%.8b >> 2)        = %.8b = %d\n", x, x, x>>2, x>>2)

	// x & y - побітова операція "І" (AND)
	// x = 00001001, y = 00011100 -> x & y = 00001000 (8)
	fmt.Printf("x & y   = (%d & %d)  = (%.8b & %.8b)  = %.8b = %d\n", x, y, x, y, x&y, x&y)

	// x | y - побітова операція "АБО" (OR)
	// x = 00001001, y = 00011100 -> x | y = 00011101 (29)
	fmt.Printf("x | y   = (%d | %d)  = (%.8b | %.8b)  = %.8b = %d\n", x, y, x, y, x|y, x|y)

	// x ^ y - побітова операція "виключне АБО" (XOR)
	// x = 00001001, y = 00011100 -> x ^ y = 00010101 (21)
	fmt.Printf("x ^ y   = (%d ^ %d)  = (%.8b ^ %.8b)  = %.8b = %d\n", x, y, x, y, x^y, x^y)

	// x &^ y - побітова операція "AND NOT"
	// x = 00001001, y = 00011100 -> x &^ y = 00000001 (1)
	fmt.Printf("x &^ y  = (%d &^ %d) = (%.8b &^ %.8b) = %.8b = %d\n", x, y, x, y, x&^y, x&^y)

	// x % y - залишок від ділення
	// x = 9, y = 28 -> x % y = 9
	fmt.Printf("x %% y   = (%d %% %d)  = (%.8b %% %.8b)  = %.8b = %d\n", x, y, x, y, x%y, x%y)

	fmt.Println("\nБитовые операции с присваиванием")

	// &= - операція "І" з присвоєнням
	x = z
	x &= y // x = 8
	fmt.Printf("x &= y   = (%d &= %d)  = (%.8b &= %.8b)  = %.8b = %d\n", z, y, z, y, x, x)

	// |= - операція "АБО" з присвоєнням
	x = z
	x |= y // x = 29
	fmt.Printf("x |= y   = (%d |= %d)  = (%.8b |= %.8b)  = %.8b = %d\n", z, y, z, y, x, x)

	// ^= - операція "виключне АБО" з присвоєнням
	x = z
	x ^= y // x = 21
	fmt.Printf("x ^= y   = (%d ^= %d)  = (%.8b ^= %.8b)  = %.8b = %d\n", z, y, z, y, x, x)

	// &^= - операція "AND NOT" з присвоєнням
	x = z
	x &^= y // x = 1
	fmt.Printf("x &^= y  = (%d &^= %d) = (%.8b &^= %.8b) = %.8b = %d\n", z, y, z, y, x, x)

	// %= - залишок від ділення з присвоєнням
	x = z
	x %= y // x = 9
	fmt.Printf("x %%= y   = (%d %%= %d)  = (%.8b %%= %.8b)  = %.8b = %d\n", z, y, z, y, x, x)

	//Задание.
	//1. Пояснить результаты операций
}
